app/controllers/scores_controller.rb

    def index
        scores = Score.all
---
SELECT "scores".* FROM "scores"

    def show
        score = Score.find_by(id: params[:id])
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        score = Score.create(score_params)
---
INSERT INTO "scores" ("score_num", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score_num", 0], ["user_id", 16], ["created_at", "2019-10-23 14:57:08.120923"], ["updated_at", "2019-10-23 14:57:08.120923"]]