app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["username", "test"], ["email", "test@test.com"], ["created_at", "2019-10-22 15:21:01.815965"], ["updated_at", "2019-10-22 15:21:01.815965"]]